{
  "version": "https://jsonfeed.org/version/1",
  "title": "Навожу суету",
  "home_page_url": "https://klimakov.me",
  "feed_url": "https://update-me.com/feed/feed.json",
  "description": "Блог Климакова Олега. Фронтенд, Разработка, Работа в IT и много чего другого",
  "author": {
    "name": "Author Name. Update me.",
    "url": ""
  },
  "items": [{
      "id": "https://klimakov.me/how-to-update-preview-in-telegram/",
      "url": "https://klimakov.me/how-to-update-preview-in-telegram/",
      "title": "Настройки сайта для социальных сетей",
      "content_html": "<p>Когда вы делитесь ссылкой в соц сетях на ваш сайт, думаю вы захотите чтобы ссылка подгружала еще и описание и картинку. Это позволит еще до захода на сайт понять краткую информацию о том, что их по этой ссылке ждёт.</p>\n<p><img src=\"https://paper-attachments.dropbox.com/s_7B204BE2F04460F624F00D3E5A7703C3103EDB20DEC16C751BFBCD6C59F81001_1627288744420_++2021-07-26++11.38.53.png\" alt=\"\"></p>\n<p>Как же сделать чтобы соцсети умели так отображать ваш сайт?<br>\nДля описания вам внутри тега <code>&lt;head&gt;</code> в html вашей страницы добавить <code>&lt;meta content=&quot;Описание вашего сайта&quot; property=&quot;og:description&quot;&gt;</code><br>\nДля картинки <code>&lt;meta content=&quot;ссылка на ваше изображение&quot; property=&quot;og:image&quot;&gt;</code><br>\nДля названия сайта <code>&lt;meta content=&quot;Название сайта&quot; property=&quot;og:title&quot;&gt;</code></p>\n<h1 id=\"%D1%80%D0%B5%D1%88%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BF%D1%80%D0%BE%D0%B1%D0%BB%D0%B5%D0%BC\">Решение проблем <a class=\"direct-link\" href=\"#%D1%80%D0%B5%D1%88%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BF%D1%80%D0%BE%D0%B1%D0%BB%D0%B5%D0%BC\">#</a></h1>\n<h2 id=\"telegram%3A\">Telegram: <a class=\"direct-link\" href=\"#telegram%3A\">#</a></h2>\n<p>Бывает ситуация что данные в тегах вы добавили или обновили, а превью вашего сайта не изменилось. В такой ситуации <a href=\"https://t.me/WebpageBot\">вам поможет бот</a>. Отправьте ему ссылку на ваш сайт и он обновит все настройки.</p>\n",
      "date_published": "2021-07-26T00:00:00-00:00"
    },{
      "id": "https://klimakov.me/how-to-be-actual/",
      "url": "https://klimakov.me/how-to-be-actual/",
      "title": "Как быть актуальным на рынке труда",
      "content_html": "<p>Эта статья будет первой в серии про работу, следующие статьи будут уже касаться более частных тем — например, проведение и прохождение собеседований. Но начать следует с того, как вообще быть к ним готовым и быть в тонусе.</p>\n<h1 id=\"%D0%B4%D0%BB%D1%8F-%D0%BA%D0%BE%D0%B3%D0%BE-%D1%8D%D1%82%D0%BE-%D1%81%D1%82%D0%B0%D1%82%D1%8C%D1%8F%3F\">Для кого это статья? <a class=\"direct-link\" href=\"#%D0%B4%D0%BB%D1%8F-%D0%BA%D0%BE%D0%B3%D0%BE-%D1%8D%D1%82%D0%BE-%D1%81%D1%82%D0%B0%D1%82%D1%8C%D1%8F%3F\">#</a></h1>\n<p>Вообще — для всех. Даже если вам не хочется менять работу — эта статья расскажет вам о том, как прокачиваться на текущем месте и расти как личностно, так и в деньгах. Аналогия здесь, примерно как со спортом, даже если вы не хотите участвовать в соревнованиях, держать себя в форме было бы неплохо.</p>\n<h1 id=\"%D1%87%D1%82%D0%BE-%D0%BD%D1%83%D0%B6%D0%BD%D0%BE-%D0%BF%D0%BE%D0%BD%D1%8F%D1%82%D1%8C%3F\">Что нужно понять? <a class=\"direct-link\" href=\"#%D1%87%D1%82%D0%BE-%D0%BD%D1%83%D0%B6%D0%BD%D0%BE-%D0%BF%D0%BE%D0%BD%D1%8F%D1%82%D1%8C%3F\">#</a></h1>\n<p>Как по мне — эти вещи важно понимать про себя и про найм. Некоторые пункты написаны Капитаном Очевидностью, но, к сожалению, не все их понимают.</p>\n<h2 id=\"%D1%8D%D1%82%D0%BE-%D0%BB%D0%B8%D1%87%D0%BD%D1%8B%D0%B9-%D0%B1%D0%BB%D0%BE%D0%B3.\">Это личный блог. <a class=\"direct-link\" href=\"#%D1%8D%D1%82%D0%BE-%D0%BB%D0%B8%D1%87%D0%BD%D1%8B%D0%B9-%D0%B1%D0%BB%D0%BE%D0%B3.\">#</a></h2>\n<p>Важно понимать что всё, что я транслирую далее, это полностью мой личный опыт. Он субъективный, возможно где-то неправильный, где-то неточный, где-то не охватывает все нюансы. Не согласны с чем-то? Гоу обсуждать, я открыт к критике и готов дополнять статью, в том числе и вашими замечаниями.</p>\n<h2 id=\"%D0%BF%D0%BE%D0%B8%D1%81%D0%BA-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B-%E2%80%94-%D1%8D%D1%82%D0%BE-%D0%BF%D1%80%D0%BE%D0%B4%D0%B0%D0%B6%D0%B0.-%D0%B0-%D0%BD%D0%B0%D0%B9%D0%BC-%E2%80%94-%D1%81%D0%B4%D0%B5%D0%BB%D0%BA%D0%B0.\">Поиск работы — это продажа. А найм — сделка. <a class=\"direct-link\" href=\"#%D0%BF%D0%BE%D0%B8%D1%81%D0%BA-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B-%E2%80%94-%D1%8D%D1%82%D0%BE-%D0%BF%D1%80%D0%BE%D0%B4%D0%B0%D0%B6%D0%B0.-%D0%B0-%D0%BD%D0%B0%D0%B9%D0%BC-%E2%80%94-%D1%81%D0%B4%D0%B5%D0%BB%D0%BA%D0%B0.\">#</a></h2>\n<p>А мир вокруг большой капиталистический рынок. И с этим ничего не поделать. Устроиться на работу - это по большому счету продать себя. Продать своё время, знания и опыт, а взамен получить само собой деньги. Могут быть проекты, в которые вы вовлечены потому что просто интересно, мир опенсорса тоже живет на энтузиастах, но поесть хочется каждый день. И ваша основная работа должна приносить достаточно денег. Достаточно для того, чтобы чувствовать себя уверенно и не депрессивно. Поэтому предложение о работе всегда нужно воспринимать как сделку.</p>\n<p><img src=\"https://sun9-23.userapi.com/impg/VTPwrjYMuDplzqyPRBFCPiv2J4T7a1Qu7xvr1g/OTPTIL5xcP8.jpg?size=695x420&amp;quality=96&amp;sign=ed847ed6654e257cca3e8b9890757361&amp;type=album\" alt=\"img\"></p>\n<h2 id=\"%D0%B4%D0%B2%D0%B8%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%E2%80%94-%D0%B6%D0%B8%D0%B7%D0%BD%D1%8C.\">Движение — жизнь. <a class=\"direct-link\" href=\"#%D0%B4%D0%B2%D0%B8%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%E2%80%94-%D0%B6%D0%B8%D0%B7%D0%BD%D1%8C.\">#</a></h2>\n<p>Пафосно? Да, но я не придумал как это назвать по-другому. Вам нужно постоянно развиваться. Не 24/7, но довольно много в любом случае, особенно если вы разработчик, особенно если вы фронтенд разработчик. Фронтенд меняется вообще быстрее, чем люди книги по нему пишут и выпускают.</p>\n<p>Развивайтесь постоянно, я собеседовал много людей у кого опыт работы 3-5 лет, а знания на уровне младшего разработчика. Это очень сильно удручает во время собесов.</p>\n<h1 id=\"%D0%BA%D0%B0%D0%BA-%D1%80%D0%B0%D0%B7%D0%B2%D0%B8%D0%B2%D0%B0%D1%82%D1%8C%D1%81%D1%8F%3F\">Как развиваться? <a class=\"direct-link\" href=\"#%D0%BA%D0%B0%D0%BA-%D1%80%D0%B0%D0%B7%D0%B2%D0%B8%D0%B2%D0%B0%D1%82%D1%8C%D1%81%D1%8F%3F\">#</a></h1>\n<h2 id=\"%D0%BF%D1%80%D0%BE%D0%BA%D0%B0%D1%87%D0%B8%D0%B2%D0%B0%D0%B9%D1%82%D0%B5-%D1%8F%D0%B7%D1%8B%D0%BA.\">Прокачивайте язык. <a class=\"direct-link\" href=\"#%D0%BF%D1%80%D0%BE%D0%BA%D0%B0%D1%87%D0%B8%D0%B2%D0%B0%D0%B9%D1%82%D0%B5-%D1%8F%D0%B7%D1%8B%D0%BA.\">#</a></h2>\n<p>Это всё ещё советы для разработчиков, а не для эскортниц. Английский язык прокачивайте. Даже если патриот, Россия лучшая в мире страна и русский автопром кайф — без английского вы всё равно далеко не уедете.</p>\n<p>Почему? Потому что на английском:</p>\n<ul>\n<li>Топовые курсы</li>\n<li>Самые актуальные статьи. Посмотрите на Хабр, там вся годнота - это переводы зарубежных статьей. Не ждите перевода, читатайте первыми.</li>\n<li>Если гуглить на английском, то шансы найти ответ в разы больше.</li>\n<li><s>Пора сваливать</s></li>\n</ul>\n<p>Как его прокачивать — способов куча. Советов, как это делать, тоже как грязи. Расскажу про свой опыт.</p>\n<p>Если интересно с чего я начинал изучение, то читайте дальше, если нет — смело пропускаейте следующие 3 абзаца.</p>\n<p>Английский я средненько учил в школе. В нашей дремучей провинции это считалось чем-то постыдным даже, знать английский, &quot;а на кой он нужен, если все скоро будут говорить по-русски&quot;. Великая же держава и все такое.</p>\n<p>Мне повезло что знакомая родителей была репетитором в языковой школе и она предложила подтянуть язык за какие-то смешные деньги. Прозанимался я от силы месяца 2, за которые мне в голову более менее уложили времена.</p>\n<p>Потом был второй подход в университете, там мне повезло пройти в топовую по уровню группу английского языка (да, нас разбили на группы по уровню языка, Томский Политех, на минуточку), в котором я был если не самым худшим студентом, то почти. Другие шпарили как на втором родном, я же больше выдавливал из себя что-то односложное и не слишком сильно стремился эти знания преувеличить. Как, собственно, и все знания в университете. Они там сконцентрированы и полезны, но ты в тот момент слишком глуп и не понимаешь куда это можно применить. Слишком рано мы получаем образование.</p>\n<p>И вот мы подобрались к изучению уже после университета. В компании в которой я работал оплачивали языковые курсы онлайн. Они то, как мне кажется, и дали больше всего:</p>\n<ul>\n<li>Практику — чем больше вы говорите, тем лучше</li>\n<li>Упорядочили мои знания, добавились новые. (Исправили старые баги, добавили новые)</li>\n</ul>\n<p>Основные советы, что могу дать:</p>\n<ul>\n<li>Найдите своего преподавателя. Это суперважно. Вы должны быть на одной волне и должны чувствовать, что вы начинаете двигаться вперед, а занятия проходят интересно. Я своего преподавателя нашел после того как сменил 3-х</li>\n<li>Делайте домашки. Если мой преподаватель сейчас читает это, то думаю ее реакция будет такой:<br>\n<img src=\"https://sun9-17.userapi.com/impg/5QWawE09VhpjVXj-gnTWSsBDGOpimpPjePuOxw/L3-haVd9uAY.jpg?size=675x448&amp;quality=96&amp;sign=9d362e55fbccc79341e235222651c44a&amp;type=album\" alt=\"o rly\"><br>\nПотому что на данный момент у меня 20+ невыполненных домашек. В сутках только 24 часа и, ну вы понимаете. Прокрастинация мне не чужда.</li>\n<li>Попробуйте больше погружаться в среду. Слушайте подкасты на английском, фильмы, книги читайте, в языковой клуб пойдите.</li>\n</ul>\n<h2 id=\"%D1%83%D0%B2%D0%B5%D0%BB%D0%B8%D1%87%D1%8C%D1%82%D0%B5-%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA-%D0%B8%D1%81%D1%82%D0%BE%D1%87%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2\">Увеличьте список источников <a class=\"direct-link\" href=\"#%D1%83%D0%B2%D0%B5%D0%BB%D0%B8%D1%87%D1%8C%D1%82%D0%B5-%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA-%D0%B8%D1%81%D1%82%D0%BE%D1%87%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2\">#</a></h2>\n<p>Получать знания нужно отовсюду. Расскажу про свои источники.</p>\n<ul>\n<li>Читайте соц сети и подписывайтесь на известных разработчиков. В основном они сидят в твиттере и постят кучу годноты туда. Русскоязычные предпочитают телеграмм.</li>\n<li>Читайте книги и воспринимайте их критически. Авторы многих подходов с течением времени меняют свои взгляды, технологии идут вперед, поэтому если у вас не получается что-то применить - значит оно написано не для вас.</li>\n</ul>\n<p><img src=\"https://sun9-51.userapi.com/impg/PV3TlVvU9szg_8lLddEwhebASKyNJGilMGfXhw/fp6unDO4A0Y.jpg?size=600x331&amp;quality=96&amp;sign=4e6cf69149934fb943cb6b06680ff342&amp;type=album\" alt=\"img\"></p>\n<ul>\n<li>Подкасты. Я все собираюсь продолжить их слушать, но мне лично тяжело. Текстом информацию я воспринимаю легче, в тексте воду можно глазами пропускать. Сюда же клабхаус. Про него еще кто-то помнит?</li>\n<li>Курсы. Раньше проходил платные и огромные, которые с вебинарами и домашками. Сейчас за 1000 рублей покупаю на Udemy, если хочу какую-нибудь новую технологию освоить. Но тут проблема как и из предыдущего пункта — нужно слушать, текстом было бы проще.</li>\n<li>Medium и Хабр. Спорные, конечно, но иногда годнота встречается. Все топовые авторы пишут в свои личные блоги. Топовые авторы и я. =)</li>\n<li>Конференции, митапы. Бывают платные и бесплатные, онлайн и оффлайн. Платные иногда по информации хуже, чем бесплатные. Всё зависит от тем и спикеров. Онлайн удобнее тем, что ехать никуда не нужно, на оффлайн дают пиццу.</li>\n</ul>\n<h2 id=\"%D0%BF%D1%80%D0%B8%D0%BC%D0%B5%D0%BD%D1%8F%D0%B9%D1%82%D0%B5\">Применяйте <a class=\"direct-link\" href=\"#%D0%BF%D1%80%D0%B8%D0%BC%D0%B5%D0%BD%D1%8F%D0%B9%D1%82%D0%B5\">#</a></h2>\n<p>Все предыдущие пункты не имеют смысла, если вы полученные знания просто складываете в стол. Онлайн курсы я год проходил и перепроходил, через неделю паузы всё забывается на прочь. Проходишь их заново, и так в бесконечном цикле, потому что не получится без пауз. Чтобы такой проблемы не было - сразу применяйте полученные знания на практике. Идеально, если удастся применить на работе, но в крайнем случае пишите домашние проекты (приватные репозитории и никто не узнает, даже, если вы напишите ужасный код).</p>\n<h1 id=\"%D0%B4%D0%B0%D0%BB%D1%8C%D1%88%D0%B5\">Дальше <a class=\"direct-link\" href=\"#%D0%B4%D0%B0%D0%BB%D1%8C%D1%88%D0%B5\">#</a></h1>\n<p>В следующей статье расскажу про свой старт карьеры в IT и как вам стартануть, если вы еще не там.</p>\n",
      "date_published": "2021-05-20T00:00:00-00:00"
    },{
      "id": "https://klimakov.me/first-post-localhost/",
      "url": "https://klimakov.me/first-post-localhost/",
      "title": "Первый тост за локалхост",
      "content_html": "<h1 id=\"%D0%BA%D1%82%D0%BE-%D1%8F-%D0%B2%D0%BE%D0%BE%D0%B1%D1%89%D0%B5-%D1%82%D0%B0%D0%BA%D0%BE%D0%B9%3F\">Кто я вообще такой? <a class=\"direct-link\" href=\"#%D0%BA%D1%82%D0%BE-%D1%8F-%D0%B2%D0%BE%D0%BE%D0%B1%D1%89%D0%B5-%D1%82%D0%B0%D0%BA%D0%BE%D0%B9%3F\">#</a></h1>\n<p>Меня зовут Климаков Олег. Я программист, и у меня очень уж широкий опыт разработки и работы в самых разных проектах. Будь то удалёнка или офис, стартапы или IT гиганты. Свою историю становления и работы в IT я, возможно, расскажу в следующей статье.</p>\n<p>Должность моя называется Senior / Lead Frontend Developer. И теперь, когда остались только те, кто не боится англицизмов распишу. У сайтов есть то где вы кнопочки тыкаете в браузере и где хранится и обрабатывается то, что вы натыкали. Вот в компаниях я обычно отвечаю за ту часть где кнопочки.</p>\n<p><img src=\"https://lvivity.com/wp-content/uploads/2018/01/fvb-difference.png\" alt=\"Front/back\"></p>\n<p>Для тех кто в теме - что же мы делаем:</p>\n<ul>\n<li>Выгораем</li>\n<li>Пьём кофе</li>\n<li>Читаем про паттерны, алгоритмы</li>\n<li>А потом занимаемся формошлёпством и двигаем кнопочки на пиксель влево или пиксель вправо.</li>\n</ul>\n<p>Но не фронтендом единым. Для блога бэкенд написал же как-то. Ещё я хочу возобновить изучение геймдева и делиться здесь в том числе и этим. Планов вагон и маленькая тележка. Благо я люблю писать код и свою работу люблю.</p>\n<hr>\n<h2 id=\"%D0%BF%D0%BE%D1%87%D0%B5%D0%BC%D1%83%3F\">Почему? <a class=\"direct-link\" href=\"#%D0%BF%D0%BE%D1%87%D0%B5%D0%BC%D1%83%3F\">#</a></h2>\n<p><img src=\"https://birdinflight.imgix.net/wp-content/uploads/2016/05/this-is-fine_cover.jpg?fm=png&amp;q=70&amp;fit=crop&amp;crop=faces&amp;mark64=aHR0cHM6Ly9iaXJkaW5mbGlnaHQuaW1naXgubmV0L3dwLWNvbnRlbnQvdXBsb2Fkcy8yMDE5L3NuaXBwZXRfdHJpYWdsZS5wbmc&amp;mark-align=bottom,left&amp;mark-pad=0\" alt=\"Выгоральня\"><br>\nВыгорев в очередной раз на работе до меня дошла поистине гениальная идея. А что если не стоит рвать свой зад и доказывать работодателю что ты крутой и можешь работать как лошадь в карьере. В твоей карьере это конечно тоже отражается, но не хочется в этом карьере загнуться. Оставшееся от работы время лучше инвестировать в себя, свои знания и свои проекты.</p>\n<hr>\n<h2 id=\"%D0%B7%D0%B0%D1%87%D0%B5%D0%BC%3F\">Зачем? <a class=\"direct-link\" href=\"#%D0%B7%D0%B0%D1%87%D0%B5%D0%BC%3F\">#</a></h2>\n<p>А для чего вообще ведутся блоги?<br>\nВозможно чтобы куда то утрамбовать свои знания и опыт.<br>\nВозможно чтобы делиться своим опытом и знаниями.<br>\nВозможно и для того, чтобы в будущем работодатели видели тебя не просто как непонятного чувака, с которым нужно разговаривать несколько часов, чтобы понять что он за фрукт, а могли прочитать о твоих мыслях, взглядах и знаниях и опыте в интернете.<br>\nА может чтобы перевести его на английский и начать прокачивать ещё и языки.</p>\n<p>Цель моего блога находится где-то посередине. Когда мне удаётся победить синдром самозванца, то кажется что есть даже чем поделиться, так почему бы и да.</p>\n<hr>\n<h2 id=\"%D1%87%D1%82%D0%BE-%D0%B7%D0%B4%D0%B5%D1%81%D1%8C-%D0%B1%D1%83%D0%B4%D0%B5%D1%82%3F\">Что здесь будет? <a class=\"direct-link\" href=\"#%D1%87%D1%82%D0%BE-%D0%B7%D0%B4%D0%B5%D1%81%D1%8C-%D0%B1%D1%83%D0%B4%D0%B5%D1%82%3F\">#</a></h2>\n<ul>\n<li>Статьи по ангуляру и фронтенду для начинающих. Хочется заниматься популяризацией технологии, которая приносит мне хлеб с маслом.</li>\n<li>Статьи про карьеру, как выгорать быстрее/медленнее, как искать новую работу, как проходить собеседования и как их проводить</li>\n<li>Расскажу про свои потуги в бэкенде, и, если время найду, то и в геймдеве.</li>\n<li>Статьи продвинутого для меня и нубского для спецов уровня.</li>\n<li>Туториалы, надеюсь не вида «как нарисовать сову»<br>\n<img src=\"https://site.ua/uploads/post_body_images/6766/5d712da4c4232.jpg\" alt=\"Как нарисовать сову\"></li>\n<li>Тестирование идей и анонсы проектов</li>\n<li>Статьи про Эксперименты с другими технологиями (в красках). Что-то буду вспоминать из прошлого опыта, а что-то брать из нового</li>\n<li>Путешествия. Я не знаю где взять силы и время, но хотелось бы обработать гигабайты фото и видео с дрона и оформить их уже хоть в каком то виде!!!</li>\n</ul>\n",
      "date_published": "2021-05-07T00:00:00-00:00"
    }
  ]
}
